---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ericqian/Princeton/Courses/ECO 518/homework/guns_518.log
  log type:  text
 opened on:  21 Mar 2021, 19:22:12

. set more 1;

. set memory 50000;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set linesize 255;

. ***********************************;
. * Read In Data;
.  use guns.dta;

. *;
. **************************************************************;
. desc;

Contains data from guns.dta
  obs:         1,173                          
 vars:            13                          21 Nov 2005 17:56
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
year            byte    %9.0g                 
vio             float   %9.0g                 Violent Crime Rate per 100,000 population (BJS)
mur             float   %9.0g                 Murder Crime Rate per 100,000 population (BJS)
rob             float   %9.0g                 Robbery Crime Rate per 100,000 population (BJS)
incarc_rate     int     %8.0g                 72-99 ONLY - Lagged Rate per 100,000 resident pop of sentenced prisoners in Stat
pb1064          float   %9.0g                 
pw1064          float   %9.0g                 
pm1029          float   %9.0g                 
pop             float   %9.0g                 
avginc          float   %9.0g                 
density         float   %9.0g                 
stateid         byte    %9.0g                 
shall           byte    %9.0g                 
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. summarize;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |      1,173          88    6.636079         77         99
         vio |      1,173    503.0747    334.2772         47     2921.8
         mur |      1,173    7.665132     7.52271         .2       80.6
         rob |      1,173    161.8202      170.51        6.4     1635.1
 incarc_rate |      1,173    226.5797    178.8881         19       1913
-------------+---------------------------------------------------------
      pb1064 |      1,173    5.336217    4.885688   .2482066   26.97957
      pw1064 |      1,173    62.94543    9.761527   21.78043   76.52575
      pm1029 |      1,173    16.08113    1.732143   12.21368   22.35269
         pop |      1,173    4.816341    5.252115    .402753   33.14512
      avginc |      1,173     13.7248    2.554543   8.554884   23.64671
-------------+---------------------------------------------------------
     density |      1,173    .3520382    1.355472   .0007071   11.10212
     stateid |      1,173    28.96078    15.68352          1         56
       shall |      1,173    .2429668    .4290581          0          1

. *************************************************************;
. gen lvio = ln(vio);

. tabulate stateid, generate(st);

    stateid |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23        1.96        1.96
          2 |         23        1.96        3.92
          4 |         23        1.96        5.88
          5 |         23        1.96        7.84
          6 |         23        1.96        9.80
          8 |         23        1.96       11.76
          9 |         23        1.96       13.73
         10 |         23        1.96       15.69
         11 |         23        1.96       17.65
         12 |         23        1.96       19.61
         13 |         23        1.96       21.57
         15 |         23        1.96       23.53
         16 |         23        1.96       25.49
         17 |         23        1.96       27.45
         18 |         23        1.96       29.41
         19 |         23        1.96       31.37
         20 |         23        1.96       33.33
         21 |         23        1.96       35.29
         22 |         23        1.96       37.25
         23 |         23        1.96       39.22
         24 |         23        1.96       41.18
         25 |         23        1.96       43.14
         26 |         23        1.96       45.10
         27 |         23        1.96       47.06
         28 |         23        1.96       49.02
         29 |         23        1.96       50.98
         30 |         23        1.96       52.94
         31 |         23        1.96       54.90
         32 |         23        1.96       56.86
         33 |         23        1.96       58.82
         34 |         23        1.96       60.78
         35 |         23        1.96       62.75
         36 |         23        1.96       64.71
         37 |         23        1.96       66.67
         38 |         23        1.96       68.63
         39 |         23        1.96       70.59
         40 |         23        1.96       72.55
         41 |         23        1.96       74.51
         42 |         23        1.96       76.47
         44 |         23        1.96       78.43
         45 |         23        1.96       80.39
         46 |         23        1.96       82.35
         47 |         23        1.96       84.31
         48 |         23        1.96       86.27
         49 |         23        1.96       88.24
         50 |         23        1.96       90.20
         51 |         23        1.96       92.16
         53 |         23        1.96       94.12
         54 |         23        1.96       96.08
         55 |         23        1.96       98.04
         56 |         23        1.96      100.00
------------+-----------------------------------
      Total |      1,173      100.00

. global st_vars "st2  st3  st4  st5  st6  st7  st8  st9 
>                 st10 st11 st12 st13 st14 st15 st16 st17 st18 st19 
>                 st20 st21 st22 st23 st24 st25 st26 st27 st28 st29 
>                 st30 st31 st32 st33 st34 st35 st36 st37 st38 st39 
>                 st40 st41 st42 st43 st44 st45 st46 st47 st48 st49
>                 st50 st51";

. global basevars "incarc_rate density avginc pop pb1064 
>                  pw1064 pm1029";

.  *************************************************************;
. xtset stateid year;
       panel variable:  stateid (strongly balanced)
        time variable:  year, 77 to 99
                delta:  1 unit

. reg lvio shall $basevars $st_vars;

      Source |       SS           df       MS      Number of obs   =     1,173
-------------+----------------------------------   F(58, 1114)     =    306.93
       Model |  459.854887        58  7.92853254   Prob > F        =    0.0000
    Residual |  28.7766714     1,114  .025831841   R-squared       =    0.9411
-------------+----------------------------------   Adj R-squared   =    0.9380
       Total |  488.631558     1,172  .416921125   Root MSE        =    .16072

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
         st2 |   .0559649   .0727213     0.77   0.442    -.0867213     .198651
         st3 |   .2404116   .0887689     2.71   0.007     .0662385    .4145848
         st4 |  -.1272757   .0664795    -1.91   0.056    -.2577149    .0031635
         st5 |   .2442405   .2304245     1.06   0.289    -.2078744    .6963554
         st6 |  -.1050866   .1121747    -0.94   0.349    -.3251842    .1150109
         st7 |  -.0955651   .1348337    -0.71   0.479    -.3601218    .1689916
         st8 |   .0975979   .0767356     1.27   0.204    -.0529647    .2481605
         st9 |   2.759405   .7797288     3.54   0.000     1.229502    4.289307
        st10 |   .6771463   .1135223     5.96   0.000     .4544047    .8998878
        st11 |   .0225319   .0538476     0.42   0.676    -.0831224    .1281861
        st12 |  -1.127962   .2590434    -4.35   0.000     -1.63623   -.6196937
        st13 |  -.5029989   .1220814    -4.12   0.000    -.7425344   -.2634634
        st14 |   .4085668   .1072083     3.81   0.000     .1982138    .6189197
        st15 |  -.2056563   .1110607    -1.85   0.064    -.4235679    .0122553
        st16 |    -.62914   .1277561    -4.92   0.000    -.8798097   -.3784703
        st17 |   -.180834   .1015614    -1.78   0.075    -.3801071    .0184391
        st18 |  -.4255548   .1049019    -4.06   0.000    -.6313824   -.2197272
        st19 |   .3685392    .057251     6.44   0.000     .2562073    .4808711
        st20 |  -1.131981   .1330361    -8.51   0.000     -1.39301   -.8709513
        st21 |   .3961276   .0592262     6.69   0.000     .2799202     .512335
        st22 |   .2869058   .1489839     1.93   0.054     -.005415    .5792265
        st23 |   .2449163   .0991731     2.47   0.014     .0503291    .4395035
        st24 |  -.5760094   .1251856    -4.60   0.000    -.8216356   -.3303833
        st25 |   -.392985   .0771168    -5.10   0.000    -.5442955   -.2416745
        st26 |   .1455349   .0922059     1.58   0.115    -.0353819    .3264516
        st27 |  -.9910133   .1051692    -9.42   0.000    -1.197365   -.7846612
        st28 |  -.4432373     .11437    -3.88   0.000    -.6676422   -.2188325
        st29 |   .3226112   .0865611     3.73   0.000       .15277    .4924524
        st30 |  -1.277052    .139976    -9.12   0.000    -1.551698   -1.002406
        st31 |   .1222139   .1265728     0.97   0.334     -.126134    .3705618
        st32 |   .3817845   .0768095     4.97   0.000     .2310769    .5324921
        st33 |   .4354412   .1459921     2.98   0.003     .1489906    .7218917
        st34 |  -.0965572   .0549367    -1.76   0.079    -.2043483    .0112339
        st35 |  -1.843342    .111446   -16.54   0.000     -2.06201   -1.624675
        st36 |  -.1884885   .1257346    -1.50   0.134    -.4351919    .0582149
        st37 |  -.0411461   .0684913    -0.60   0.548    -.1755325    .0932403
        st38 |   .0049471   .1153633     0.04   0.966    -.2214067    .2313009
        st39 |  -.3249639   .1370178    -2.37   0.018     -.593806   -.0561218
        st40 |  -.1003761   .1577365    -0.64   0.525    -.4098703     .209118
        st41 |    .334051   .0576949     5.79   0.000     .2208482    .4472539
        st42 |  -1.024605   .0989142   -10.36   0.000    -1.218684   -.8305256
        st43 |   .0446805   .0720137     0.62   0.535    -.0966174    .1859784
        st44 |   .0526546   .1451395     0.36   0.717    -.2321229    .3374321
        st45 |  -.3039108   .1136771    -2.67   0.008     -.526956   -.0808655
        st46 |  -1.254522   .1352965    -9.27   0.000    -1.519987   -.9890573
        st47 |  -.6017665   .0614983    -9.79   0.000    -.7224321   -.4811009
        st48 |  -.1321725   .1036698    -1.27   0.203    -.3355826    .0712377
        st49 |  -.9691482    .122316    -7.92   0.000    -1.209144   -.7291524
        st50 |  -.7812224   .1174512    -6.65   0.000    -1.011673   -.5507718
        st51 |  -.4804004    .121985    -3.94   0.000    -.7197467   -.2410541
       _cons |   4.036775   .3893662    10.37   0.000     3.272801    4.800749
------------------------------------------------------------------------------

. reg lvio shall $basevars $st_vars, robust;

Linear regression                               Number of obs     =      1,173
                                                F(58, 1114)       =     364.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9411
                                                Root MSE          =     .16072

------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0199433    -2.31   0.021    -.0852721    -.007011
 incarc_rate |   -.000071   .0000973    -0.73   0.466    -.0002619    .0001199
     density |  -.1722901   .1048789    -1.64   0.101    -.3780725    .0334923
      avginc |  -.0092037   .0067335    -1.37   0.172    -.0224155     .004008
         pop |   .0115247   .0097044     1.19   0.235    -.0075162    .0305655
      pb1064 |   .1042804   .0165552     6.30   0.000     .0717976    .1367633
      pw1064 |   .0408611   .0053859     7.59   0.000     .0302935    .0514287
      pm1029 |  -.0502725   .0077908    -6.45   0.000    -.0655588   -.0349863
         st2 |   .0559649   .0788371     0.71   0.478     -.098721    .2106508
         st3 |   .2404116   .0872338     2.76   0.006     .0692506    .4115727
         st4 |  -.1272757   .0714501    -1.78   0.075    -.2674676    .0129162
         st5 |   .2442405   .2377303     1.03   0.304    -.2222091    .7106901
         st6 |  -.1050866   .1180061    -0.89   0.373    -.3366259    .1264526
         st7 |  -.0955651   .1412479    -0.68   0.499     -.372707    .1815768
         st8 |   .0975979   .0824469     1.18   0.237    -.0641708    .2593666
         st9 |   2.759405   1.004794     2.75   0.006     .7879034    4.730906
        st10 |   .6771463    .120142     5.64   0.000     .4414162    .9128763
        st11 |   .0225319   .0546559     0.41   0.680    -.0847082    .1297719
        st12 |  -1.127962   .2586365    -4.36   0.000    -1.635431   -.6204921
        st13 |  -.5029989   .1235745    -4.07   0.000    -.7454639   -.2605339
        st14 |   .4085668     .11285     3.62   0.000     .1871443    .6299893
        st15 |  -.2056563   .1159915    -1.77   0.076    -.4332428    .0219302
        st16 |    -.62914   .1317084    -4.78   0.000    -.8875644   -.3707155
        st17 |   -.180834    .100972    -1.79   0.074    -.3789507    .0172826
        st18 |  -.4255548    .109101    -3.90   0.000    -.6396214   -.2114882
        st19 |   .3685392   .0573607     6.42   0.000     .2559921    .4810863
        st20 |  -1.131981   .1508213    -7.51   0.000    -1.427907    -.836055
        st21 |   .3961276    .063419     6.25   0.000     .2716935    .5205617
        st22 |   .2869058   .1571261     1.83   0.068    -.0213907    .5952022
        st23 |   .2449163   .1050504     2.33   0.020     .0387974    .4510353
        st24 |  -.5760094   .1290485    -4.46   0.000    -.8292149   -.3228039
        st25 |   -.392985   .0779873    -5.04   0.000    -.5460035   -.2399664
        st26 |   .1455349   .0931743     1.56   0.119     -.037282    .3283517
        st27 |  -.9910133   .1227763    -8.07   0.000    -1.231912   -.7501144
        st28 |  -.4432373   .1203529    -3.68   0.000    -.6793813   -.2070933
        st29 |   .3226112    .091537     3.52   0.000     .1430069    .5022155
        st30 |  -1.277052   .1466122    -8.71   0.000    -1.564719   -.9893846
        st31 |   .1222139   .1427175     0.86   0.392    -.1578116    .4022394
        st32 |   .3817845   .0785617     4.86   0.000     .2276388    .5359302
        st33 |   .4354412   .1727981     2.52   0.012     .0963948    .7744876
        st34 |  -.0965572   .0568864    -1.70   0.090    -.2081738    .0150594
        st35 |  -1.843342   .1136284   -16.22   0.000    -2.066292   -1.620393
        st36 |  -.1884885   .1338693    -1.41   0.159    -.4511528    .0741758
        st37 |  -.0411461   .0681355    -0.60   0.546    -.1748345    .0925422
        st38 |   .0049471   .1193755     0.04   0.967    -.2292791    .2391733
        st39 |  -.3249639   .1439168    -2.26   0.024    -.6073424   -.0425853
        st40 |  -.1003761   .1670446    -0.60   0.548    -.4281337    .2273814
        st41 |    .334051   .0576435     5.80   0.000     .2209491     .447153
        st42 |  -1.024605   .1040919    -9.84   0.000    -1.228843   -.8203664
        st43 |   .0446805   .0802028     0.56   0.578    -.1126852    .2020461
        st44 |   .0526546   .1592362     0.33   0.741    -.2597821    .3650912
        st45 |  -.3039108   .1119628    -2.71   0.007    -.5235925    -.084229
        st46 |  -1.254522   .1497569    -8.38   0.000    -1.548359   -.9606845
        st47 |  -.6017665    .060131   -10.01   0.000    -.7197493   -.4837837
        st48 |  -.1321725   .1076604    -1.23   0.220    -.3434124    .0790675
        st49 |  -.9691482    .127291    -7.61   0.000    -1.218905    -.719391
        st50 |  -.7812224   .1200961    -6.50   0.000    -1.016862   -.5455823
        st51 |  -.4804004   .1293103    -3.72   0.000    -.7341196   -.2266813
       _cons |   4.036775   .3845839    10.50   0.000     3.282185    4.791366
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,1114)         =      38.77
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
       _cons |   3.866017   .3847716    10.05   0.000     3.111058    4.620975
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(50, 1114) = 142.57                  Prob > F = 0.0000

. xtreg lvio shall $basevars, fe robust;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe vce(cluster stateid);

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. bootstrap, seed(1), rep(500): xtreg lvio shall $basevars, fe;
invalid 'rep' 
r(198);

end of do-file

r(198);

. do "/var/folders/j1/zz_qkt0d0d993j7bg9qz57pm0000gn/T//SD91954.000000"

. # delimit ;
delimiter now ;
. set more off;

. clear;

. cls;

. cd "/Users/ericqian/Princeton/Courses/ECO 518/homework";
/Users/ericqian/Princeton/Courses/ECO 518/homework

. *************************************************************;
. * 518 Exercise 4
> *
> *************************************************************;
. log using guns_518.log,replace;
log file already open
r(604);

end of do-file

r(604);

. do "/Users/ericqian/Princeton/Courses/ECO 518/homework/guns_518.do"

. # delimit ;
delimiter now ;
. set more off;

. clear;

. cls;

. cd "/Users/ericqian/Princeton/Courses/ECO 518/homework";
/Users/ericqian/Princeton/Courses/ECO 518/homework

. *************************************************************;
. * 518 Exercise 4
> *
> *************************************************************;
. *log using guns_518.log,replace;
. set more 1;

. set memory 50000;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set linesize 255;

. ***********************************;
. * Read In Data;
.  use guns.dta;

. *;
. **************************************************************;
. desc;

Contains data from guns.dta
  obs:         1,173                          
 vars:            13                          21 Nov 2005 17:56
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
year            byte    %9.0g                 
vio             float   %9.0g                 Violent Crime Rate per 100,000 population (BJS)
mur             float   %9.0g                 Murder Crime Rate per 100,000 population (BJS)
rob             float   %9.0g                 Robbery Crime Rate per 100,000 population (BJS)
incarc_rate     int     %8.0g                 72-99 ONLY - Lagged Rate per 100,000 resident pop of sentenced prisoners in Stat
pb1064          float   %9.0g                 
pw1064          float   %9.0g                 
pm1029          float   %9.0g                 
pop             float   %9.0g                 
avginc          float   %9.0g                 
density         float   %9.0g                 
stateid         byte    %9.0g                 
shall           byte    %9.0g                 
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. summarize;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |      1,173          88    6.636079         77         99
         vio |      1,173    503.0747    334.2772         47     2921.8
         mur |      1,173    7.665132     7.52271         .2       80.6
         rob |      1,173    161.8202      170.51        6.4     1635.1
 incarc_rate |      1,173    226.5797    178.8881         19       1913
-------------+---------------------------------------------------------
      pb1064 |      1,173    5.336217    4.885688   .2482066   26.97957
      pw1064 |      1,173    62.94543    9.761527   21.78043   76.52575
      pm1029 |      1,173    16.08113    1.732143   12.21368   22.35269
         pop |      1,173    4.816341    5.252115    .402753   33.14512
      avginc |      1,173     13.7248    2.554543   8.554884   23.64671
-------------+---------------------------------------------------------
     density |      1,173    .3520382    1.355472   .0007071   11.10212
     stateid |      1,173    28.96078    15.68352          1         56
       shall |      1,173    .2429668    .4290581          0          1

. *************************************************************;
. gen lvio = ln(vio);

. tabulate stateid, generate(st);

    stateid |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23        1.96        1.96
          2 |         23        1.96        3.92
          4 |         23        1.96        5.88
          5 |         23        1.96        7.84
          6 |         23        1.96        9.80
          8 |         23        1.96       11.76
          9 |         23        1.96       13.73
         10 |         23        1.96       15.69
         11 |         23        1.96       17.65
         12 |         23        1.96       19.61
         13 |         23        1.96       21.57
         15 |         23        1.96       23.53
         16 |         23        1.96       25.49
         17 |         23        1.96       27.45
         18 |         23        1.96       29.41
         19 |         23        1.96       31.37
         20 |         23        1.96       33.33
         21 |         23        1.96       35.29
         22 |         23        1.96       37.25
         23 |         23        1.96       39.22
         24 |         23        1.96       41.18
         25 |         23        1.96       43.14
         26 |         23        1.96       45.10
         27 |         23        1.96       47.06
         28 |         23        1.96       49.02
         29 |         23        1.96       50.98
         30 |         23        1.96       52.94
         31 |         23        1.96       54.90
         32 |         23        1.96       56.86
         33 |         23        1.96       58.82
         34 |         23        1.96       60.78
         35 |         23        1.96       62.75
         36 |         23        1.96       64.71
         37 |         23        1.96       66.67
         38 |         23        1.96       68.63
         39 |         23        1.96       70.59
         40 |         23        1.96       72.55
         41 |         23        1.96       74.51
         42 |         23        1.96       76.47
         44 |         23        1.96       78.43
         45 |         23        1.96       80.39
         46 |         23        1.96       82.35
         47 |         23        1.96       84.31
         48 |         23        1.96       86.27
         49 |         23        1.96       88.24
         50 |         23        1.96       90.20
         51 |         23        1.96       92.16
         53 |         23        1.96       94.12
         54 |         23        1.96       96.08
         55 |         23        1.96       98.04
         56 |         23        1.96      100.00
------------+-----------------------------------
      Total |      1,173      100.00

. global st_vars "st2  st3  st4  st5  st6  st7  st8  st9 
>                 st10 st11 st12 st13 st14 st15 st16 st17 st18 st19 
>                 st20 st21 st22 st23 st24 st25 st26 st27 st28 st29 
>                 st30 st31 st32 st33 st34 st35 st36 st37 st38 st39 
>                 st40 st41 st42 st43 st44 st45 st46 st47 st48 st49
>                 st50 st51";

. global basevars "incarc_rate density avginc pop pb1064 
>                  pw1064 pm1029";

.  *************************************************************;
. xtset stateid year;
       panel variable:  stateid (strongly balanced)
        time variable:  year, 77 to 99
                delta:  1 unit

. reg lvio shall $basevars $st_vars;

      Source |       SS           df       MS      Number of obs   =     1,173
-------------+----------------------------------   F(58, 1114)     =    306.93
       Model |  459.854887        58  7.92853254   Prob > F        =    0.0000
    Residual |  28.7766714     1,114  .025831841   R-squared       =    0.9411
-------------+----------------------------------   Adj R-squared   =    0.9380
       Total |  488.631558     1,172  .416921125   Root MSE        =    .16072

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
         st2 |   .0559649   .0727213     0.77   0.442    -.0867213     .198651
         st3 |   .2404116   .0887689     2.71   0.007     .0662385    .4145848
         st4 |  -.1272757   .0664795    -1.91   0.056    -.2577149    .0031635
         st5 |   .2442405   .2304245     1.06   0.289    -.2078744    .6963554
         st6 |  -.1050866   .1121747    -0.94   0.349    -.3251842    .1150109
         st7 |  -.0955651   .1348337    -0.71   0.479    -.3601218    .1689916
         st8 |   .0975979   .0767356     1.27   0.204    -.0529647    .2481605
         st9 |   2.759405   .7797288     3.54   0.000     1.229502    4.289307
        st10 |   .6771463   .1135223     5.96   0.000     .4544047    .8998878
        st11 |   .0225319   .0538476     0.42   0.676    -.0831224    .1281861
        st12 |  -1.127962   .2590434    -4.35   0.000     -1.63623   -.6196937
        st13 |  -.5029989   .1220814    -4.12   0.000    -.7425344   -.2634634
        st14 |   .4085668   .1072083     3.81   0.000     .1982138    .6189197
        st15 |  -.2056563   .1110607    -1.85   0.064    -.4235679    .0122553
        st16 |    -.62914   .1277561    -4.92   0.000    -.8798097   -.3784703
        st17 |   -.180834   .1015614    -1.78   0.075    -.3801071    .0184391
        st18 |  -.4255548   .1049019    -4.06   0.000    -.6313824   -.2197272
        st19 |   .3685392    .057251     6.44   0.000     .2562073    .4808711
        st20 |  -1.131981   .1330361    -8.51   0.000     -1.39301   -.8709513
        st21 |   .3961276   .0592262     6.69   0.000     .2799202     .512335
        st22 |   .2869058   .1489839     1.93   0.054     -.005415    .5792265
        st23 |   .2449163   .0991731     2.47   0.014     .0503291    .4395035
        st24 |  -.5760094   .1251856    -4.60   0.000    -.8216356   -.3303833
        st25 |   -.392985   .0771168    -5.10   0.000    -.5442955   -.2416745
        st26 |   .1455349   .0922059     1.58   0.115    -.0353819    .3264516
        st27 |  -.9910133   .1051692    -9.42   0.000    -1.197365   -.7846612
        st28 |  -.4432373     .11437    -3.88   0.000    -.6676422   -.2188325
        st29 |   .3226112   .0865611     3.73   0.000       .15277    .4924524
        st30 |  -1.277052    .139976    -9.12   0.000    -1.551698   -1.002406
        st31 |   .1222139   .1265728     0.97   0.334     -.126134    .3705618
        st32 |   .3817845   .0768095     4.97   0.000     .2310769    .5324921
        st33 |   .4354412   .1459921     2.98   0.003     .1489906    .7218917
        st34 |  -.0965572   .0549367    -1.76   0.079    -.2043483    .0112339
        st35 |  -1.843342    .111446   -16.54   0.000     -2.06201   -1.624675
        st36 |  -.1884885   .1257346    -1.50   0.134    -.4351919    .0582149
        st37 |  -.0411461   .0684913    -0.60   0.548    -.1755325    .0932403
        st38 |   .0049471   .1153633     0.04   0.966    -.2214067    .2313009
        st39 |  -.3249639   .1370178    -2.37   0.018     -.593806   -.0561218
        st40 |  -.1003761   .1577365    -0.64   0.525    -.4098703     .209118
        st41 |    .334051   .0576949     5.79   0.000     .2208482    .4472539
        st42 |  -1.024605   .0989142   -10.36   0.000    -1.218684   -.8305256
        st43 |   .0446805   .0720137     0.62   0.535    -.0966174    .1859784
        st44 |   .0526546   .1451395     0.36   0.717    -.2321229    .3374321
        st45 |  -.3039108   .1136771    -2.67   0.008     -.526956   -.0808655
        st46 |  -1.254522   .1352965    -9.27   0.000    -1.519987   -.9890573
        st47 |  -.6017665   .0614983    -9.79   0.000    -.7224321   -.4811009
        st48 |  -.1321725   .1036698    -1.27   0.203    -.3355826    .0712377
        st49 |  -.9691482    .122316    -7.92   0.000    -1.209144   -.7291524
        st50 |  -.7812224   .1174512    -6.65   0.000    -1.011673   -.5507718
        st51 |  -.4804004    .121985    -3.94   0.000    -.7197467   -.2410541
       _cons |   4.036775   .3893662    10.37   0.000     3.272801    4.800749
------------------------------------------------------------------------------

. reg lvio shall $basevars $st_vars, robust;

Linear regression                               Number of obs     =      1,173
                                                F(58, 1114)       =     364.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9411
                                                Root MSE          =     .16072

------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0199433    -2.31   0.021    -.0852721    -.007011
 incarc_rate |   -.000071   .0000973    -0.73   0.466    -.0002619    .0001199
     density |  -.1722901   .1048789    -1.64   0.101    -.3780725    .0334923
      avginc |  -.0092037   .0067335    -1.37   0.172    -.0224155     .004008
         pop |   .0115247   .0097044     1.19   0.235    -.0075162    .0305655
      pb1064 |   .1042804   .0165552     6.30   0.000     .0717976    .1367633
      pw1064 |   .0408611   .0053859     7.59   0.000     .0302935    .0514287
      pm1029 |  -.0502725   .0077908    -6.45   0.000    -.0655588   -.0349863
         st2 |   .0559649   .0788371     0.71   0.478     -.098721    .2106508
         st3 |   .2404116   .0872338     2.76   0.006     .0692506    .4115727
         st4 |  -.1272757   .0714501    -1.78   0.075    -.2674676    .0129162
         st5 |   .2442405   .2377303     1.03   0.304    -.2222091    .7106901
         st6 |  -.1050866   .1180061    -0.89   0.373    -.3366259    .1264526
         st7 |  -.0955651   .1412479    -0.68   0.499     -.372707    .1815768
         st8 |   .0975979   .0824469     1.18   0.237    -.0641708    .2593666
         st9 |   2.759405   1.004794     2.75   0.006     .7879034    4.730906
        st10 |   .6771463    .120142     5.64   0.000     .4414162    .9128763
        st11 |   .0225319   .0546559     0.41   0.680    -.0847082    .1297719
        st12 |  -1.127962   .2586365    -4.36   0.000    -1.635431   -.6204921
        st13 |  -.5029989   .1235745    -4.07   0.000    -.7454639   -.2605339
        st14 |   .4085668     .11285     3.62   0.000     .1871443    .6299893
        st15 |  -.2056563   .1159915    -1.77   0.076    -.4332428    .0219302
        st16 |    -.62914   .1317084    -4.78   0.000    -.8875644   -.3707155
        st17 |   -.180834    .100972    -1.79   0.074    -.3789507    .0172826
        st18 |  -.4255548    .109101    -3.90   0.000    -.6396214   -.2114882
        st19 |   .3685392   .0573607     6.42   0.000     .2559921    .4810863
        st20 |  -1.131981   .1508213    -7.51   0.000    -1.427907    -.836055
        st21 |   .3961276    .063419     6.25   0.000     .2716935    .5205617
        st22 |   .2869058   .1571261     1.83   0.068    -.0213907    .5952022
        st23 |   .2449163   .1050504     2.33   0.020     .0387974    .4510353
        st24 |  -.5760094   .1290485    -4.46   0.000    -.8292149   -.3228039
        st25 |   -.392985   .0779873    -5.04   0.000    -.5460035   -.2399664
        st26 |   .1455349   .0931743     1.56   0.119     -.037282    .3283517
        st27 |  -.9910133   .1227763    -8.07   0.000    -1.231912   -.7501144
        st28 |  -.4432373   .1203529    -3.68   0.000    -.6793813   -.2070933
        st29 |   .3226112    .091537     3.52   0.000     .1430069    .5022155
        st30 |  -1.277052   .1466122    -8.71   0.000    -1.564719   -.9893846
        st31 |   .1222139   .1427175     0.86   0.392    -.1578116    .4022394
        st32 |   .3817845   .0785617     4.86   0.000     .2276388    .5359302
        st33 |   .4354412   .1727981     2.52   0.012     .0963948    .7744876
        st34 |  -.0965572   .0568864    -1.70   0.090    -.2081738    .0150594
        st35 |  -1.843342   .1136284   -16.22   0.000    -2.066292   -1.620393
        st36 |  -.1884885   .1338693    -1.41   0.159    -.4511528    .0741758
        st37 |  -.0411461   .0681355    -0.60   0.546    -.1748345    .0925422
        st38 |   .0049471   .1193755     0.04   0.967    -.2292791    .2391733
        st39 |  -.3249639   .1439168    -2.26   0.024    -.6073424   -.0425853
        st40 |  -.1003761   .1670446    -0.60   0.548    -.4281337    .2273814
        st41 |    .334051   .0576435     5.80   0.000     .2209491     .447153
        st42 |  -1.024605   .1040919    -9.84   0.000    -1.228843   -.8203664
        st43 |   .0446805   .0802028     0.56   0.578    -.1126852    .2020461
        st44 |   .0526546   .1592362     0.33   0.741    -.2597821    .3650912
        st45 |  -.3039108   .1119628    -2.71   0.007    -.5235925    -.084229
        st46 |  -1.254522   .1497569    -8.38   0.000    -1.548359   -.9606845
        st47 |  -.6017665    .060131   -10.01   0.000    -.7197493   -.4837837
        st48 |  -.1321725   .1076604    -1.23   0.220    -.3434124    .0790675
        st49 |  -.9691482    .127291    -7.61   0.000    -1.218905    -.719391
        st50 |  -.7812224   .1200961    -6.50   0.000    -1.016862   -.5455823
        st51 |  -.4804004   .1293103    -3.72   0.000    -.7341196   -.2266813
       _cons |   4.036775   .3845839    10.50   0.000     3.282185    4.791366
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,1114)         =      38.77
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
       _cons |   3.866017   .3847716    10.05   0.000     3.111058    4.620975
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(50, 1114) = 142.57                  Prob > F = 0.0000

. xtreg lvio shall $basevars, fe robust;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe vce(cluster stateid);

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. bootstrap, seed(1), rep(500): xtreg lvio shall $basevars, fe;
invalid 'rep' 
r(198);

end of do-file

r(198);

. do "/var/folders/j1/zz_qkt0d0d993j7bg9qz57pm0000gn/T//SD91954.000000"

. # delimit ;
delimiter now ;
. set more off;

. clear;

. cls;

. cd "/Users/ericqian/Princeton/Courses/ECO 518/homework";
/Users/ericqian/Princeton/Courses/ECO 518/homework

. *************************************************************;
. * 518 Exercise 4
> *
> *************************************************************;
. *log using guns_518.log,replace;
. set more 1;

. set memory 50000;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set linesize 255;

. ***********************************;
. * Read In Data;
.  use guns.dta;

. *;
. **************************************************************;
. desc;

Contains data from guns.dta
  obs:         1,173                          
 vars:            13                          21 Nov 2005 17:56
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
year            byte    %9.0g                 
vio             float   %9.0g                 Violent Crime Rate per 100,000 population (BJS)
mur             float   %9.0g                 Murder Crime Rate per 100,000 population (BJS)
rob             float   %9.0g                 Robbery Crime Rate per 100,000 population (BJS)
incarc_rate     int     %8.0g                 72-99 ONLY - Lagged Rate per 100,000 resident pop of sentenced prisoners in Stat
pb1064          float   %9.0g                 
pw1064          float   %9.0g                 
pm1029          float   %9.0g                 
pop             float   %9.0g                 
avginc          float   %9.0g                 
density         float   %9.0g                 
stateid         byte    %9.0g                 
shall           byte    %9.0g                 
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. summarize;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |      1,173          88    6.636079         77         99
         vio |      1,173    503.0747    334.2772         47     2921.8
         mur |      1,173    7.665132     7.52271         .2       80.6
         rob |      1,173    161.8202      170.51        6.4     1635.1
 incarc_rate |      1,173    226.5797    178.8881         19       1913
-------------+---------------------------------------------------------
      pb1064 |      1,173    5.336217    4.885688   .2482066   26.97957
      pw1064 |      1,173    62.94543    9.761527   21.78043   76.52575
      pm1029 |      1,173    16.08113    1.732143   12.21368   22.35269
         pop |      1,173    4.816341    5.252115    .402753   33.14512
      avginc |      1,173     13.7248    2.554543   8.554884   23.64671
-------------+---------------------------------------------------------
     density |      1,173    .3520382    1.355472   .0007071   11.10212
     stateid |      1,173    28.96078    15.68352          1         56
       shall |      1,173    .2429668    .4290581          0          1

. *************************************************************;
. gen lvio = ln(vio);

. tabulate stateid, generate(st);

    stateid |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23        1.96        1.96
          2 |         23        1.96        3.92
          4 |         23        1.96        5.88
          5 |         23        1.96        7.84
          6 |         23        1.96        9.80
          8 |         23        1.96       11.76
          9 |         23        1.96       13.73
         10 |         23        1.96       15.69
         11 |         23        1.96       17.65
         12 |         23        1.96       19.61
         13 |         23        1.96       21.57
         15 |         23        1.96       23.53
         16 |         23        1.96       25.49
         17 |         23        1.96       27.45
         18 |         23        1.96       29.41
         19 |         23        1.96       31.37
         20 |         23        1.96       33.33
         21 |         23        1.96       35.29
         22 |         23        1.96       37.25
         23 |         23        1.96       39.22
         24 |         23        1.96       41.18
         25 |         23        1.96       43.14
         26 |         23        1.96       45.10
         27 |         23        1.96       47.06
         28 |         23        1.96       49.02
         29 |         23        1.96       50.98
         30 |         23        1.96       52.94
         31 |         23        1.96       54.90
         32 |         23        1.96       56.86
         33 |         23        1.96       58.82
         34 |         23        1.96       60.78
         35 |         23        1.96       62.75
         36 |         23        1.96       64.71
         37 |         23        1.96       66.67
         38 |         23        1.96       68.63
         39 |         23        1.96       70.59
         40 |         23        1.96       72.55
         41 |         23        1.96       74.51
         42 |         23        1.96       76.47
         44 |         23        1.96       78.43
         45 |         23        1.96       80.39
         46 |         23        1.96       82.35
         47 |         23        1.96       84.31
         48 |         23        1.96       86.27
         49 |         23        1.96       88.24
         50 |         23        1.96       90.20
         51 |         23        1.96       92.16
         53 |         23        1.96       94.12
         54 |         23        1.96       96.08
         55 |         23        1.96       98.04
         56 |         23        1.96      100.00
------------+-----------------------------------
      Total |      1,173      100.00

. global st_vars "st2  st3  st4  st5  st6  st7  st8  st9 
>                 st10 st11 st12 st13 st14 st15 st16 st17 st18 st19 
>                 st20 st21 st22 st23 st24 st25 st26 st27 st28 st29 
>                 st30 st31 st32 st33 st34 st35 st36 st37 st38 st39 
>                 st40 st41 st42 st43 st44 st45 st46 st47 st48 st49
>                 st50 st51";

. global basevars "incarc_rate density avginc pop pb1064 
>                  pw1064 pm1029";

.  *************************************************************;
. xtset stateid year;
       panel variable:  stateid (strongly balanced)
        time variable:  year, 77 to 99
                delta:  1 unit

. reg lvio shall $basevars $st_vars;

      Source |       SS           df       MS      Number of obs   =     1,173
-------------+----------------------------------   F(58, 1114)     =    306.93
       Model |  459.854887        58  7.92853254   Prob > F        =    0.0000
    Residual |  28.7766714     1,114  .025831841   R-squared       =    0.9411
-------------+----------------------------------   Adj R-squared   =    0.9380
       Total |  488.631558     1,172  .416921125   Root MSE        =    .16072

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
         st2 |   .0559649   .0727213     0.77   0.442    -.0867213     .198651
         st3 |   .2404116   .0887689     2.71   0.007     .0662385    .4145848
         st4 |  -.1272757   .0664795    -1.91   0.056    -.2577149    .0031635
         st5 |   .2442405   .2304245     1.06   0.289    -.2078744    .6963554
         st6 |  -.1050866   .1121747    -0.94   0.349    -.3251842    .1150109
         st7 |  -.0955651   .1348337    -0.71   0.479    -.3601218    .1689916
         st8 |   .0975979   .0767356     1.27   0.204    -.0529647    .2481605
         st9 |   2.759405   .7797288     3.54   0.000     1.229502    4.289307
        st10 |   .6771463   .1135223     5.96   0.000     .4544047    .8998878
        st11 |   .0225319   .0538476     0.42   0.676    -.0831224    .1281861
        st12 |  -1.127962   .2590434    -4.35   0.000     -1.63623   -.6196937
        st13 |  -.5029989   .1220814    -4.12   0.000    -.7425344   -.2634634
        st14 |   .4085668   .1072083     3.81   0.000     .1982138    .6189197
        st15 |  -.2056563   .1110607    -1.85   0.064    -.4235679    .0122553
        st16 |    -.62914   .1277561    -4.92   0.000    -.8798097   -.3784703
        st17 |   -.180834   .1015614    -1.78   0.075    -.3801071    .0184391
        st18 |  -.4255548   .1049019    -4.06   0.000    -.6313824   -.2197272
        st19 |   .3685392    .057251     6.44   0.000     .2562073    .4808711
        st20 |  -1.131981   .1330361    -8.51   0.000     -1.39301   -.8709513
        st21 |   .3961276   .0592262     6.69   0.000     .2799202     .512335
        st22 |   .2869058   .1489839     1.93   0.054     -.005415    .5792265
        st23 |   .2449163   .0991731     2.47   0.014     .0503291    .4395035
        st24 |  -.5760094   .1251856    -4.60   0.000    -.8216356   -.3303833
        st25 |   -.392985   .0771168    -5.10   0.000    -.5442955   -.2416745
        st26 |   .1455349   .0922059     1.58   0.115    -.0353819    .3264516
        st27 |  -.9910133   .1051692    -9.42   0.000    -1.197365   -.7846612
        st28 |  -.4432373     .11437    -3.88   0.000    -.6676422   -.2188325
        st29 |   .3226112   .0865611     3.73   0.000       .15277    .4924524
        st30 |  -1.277052    .139976    -9.12   0.000    -1.551698   -1.002406
        st31 |   .1222139   .1265728     0.97   0.334     -.126134    .3705618
        st32 |   .3817845   .0768095     4.97   0.000     .2310769    .5324921
        st33 |   .4354412   .1459921     2.98   0.003     .1489906    .7218917
        st34 |  -.0965572   .0549367    -1.76   0.079    -.2043483    .0112339
        st35 |  -1.843342    .111446   -16.54   0.000     -2.06201   -1.624675
        st36 |  -.1884885   .1257346    -1.50   0.134    -.4351919    .0582149
        st37 |  -.0411461   .0684913    -0.60   0.548    -.1755325    .0932403
        st38 |   .0049471   .1153633     0.04   0.966    -.2214067    .2313009
        st39 |  -.3249639   .1370178    -2.37   0.018     -.593806   -.0561218
        st40 |  -.1003761   .1577365    -0.64   0.525    -.4098703     .209118
        st41 |    .334051   .0576949     5.79   0.000     .2208482    .4472539
        st42 |  -1.024605   .0989142   -10.36   0.000    -1.218684   -.8305256
        st43 |   .0446805   .0720137     0.62   0.535    -.0966174    .1859784
        st44 |   .0526546   .1451395     0.36   0.717    -.2321229    .3374321
        st45 |  -.3039108   .1136771    -2.67   0.008     -.526956   -.0808655
        st46 |  -1.254522   .1352965    -9.27   0.000    -1.519987   -.9890573
        st47 |  -.6017665   .0614983    -9.79   0.000    -.7224321   -.4811009
        st48 |  -.1321725   .1036698    -1.27   0.203    -.3355826    .0712377
        st49 |  -.9691482    .122316    -7.92   0.000    -1.209144   -.7291524
        st50 |  -.7812224   .1174512    -6.65   0.000    -1.011673   -.5507718
        st51 |  -.4804004    .121985    -3.94   0.000    -.7197467   -.2410541
       _cons |   4.036775   .3893662    10.37   0.000     3.272801    4.800749
------------------------------------------------------------------------------

. reg lvio shall $basevars $st_vars, robust;

Linear regression                               Number of obs     =      1,173
                                                F(58, 1114)       =     364.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9411
                                                Root MSE          =     .16072

------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0199433    -2.31   0.021    -.0852721    -.007011
 incarc_rate |   -.000071   .0000973    -0.73   0.466    -.0002619    .0001199
     density |  -.1722901   .1048789    -1.64   0.101    -.3780725    .0334923
      avginc |  -.0092037   .0067335    -1.37   0.172    -.0224155     .004008
         pop |   .0115247   .0097044     1.19   0.235    -.0075162    .0305655
      pb1064 |   .1042804   .0165552     6.30   0.000     .0717976    .1367633
      pw1064 |   .0408611   .0053859     7.59   0.000     .0302935    .0514287
      pm1029 |  -.0502725   .0077908    -6.45   0.000    -.0655588   -.0349863
         st2 |   .0559649   .0788371     0.71   0.478     -.098721    .2106508
         st3 |   .2404116   .0872338     2.76   0.006     .0692506    .4115727
         st4 |  -.1272757   .0714501    -1.78   0.075    -.2674676    .0129162
         st5 |   .2442405   .2377303     1.03   0.304    -.2222091    .7106901
         st6 |  -.1050866   .1180061    -0.89   0.373    -.3366259    .1264526
         st7 |  -.0955651   .1412479    -0.68   0.499     -.372707    .1815768
         st8 |   .0975979   .0824469     1.18   0.237    -.0641708    .2593666
         st9 |   2.759405   1.004794     2.75   0.006     .7879034    4.730906
        st10 |   .6771463    .120142     5.64   0.000     .4414162    .9128763
        st11 |   .0225319   .0546559     0.41   0.680    -.0847082    .1297719
        st12 |  -1.127962   .2586365    -4.36   0.000    -1.635431   -.6204921
        st13 |  -.5029989   .1235745    -4.07   0.000    -.7454639   -.2605339
        st14 |   .4085668     .11285     3.62   0.000     .1871443    .6299893
        st15 |  -.2056563   .1159915    -1.77   0.076    -.4332428    .0219302
        st16 |    -.62914   .1317084    -4.78   0.000    -.8875644   -.3707155
        st17 |   -.180834    .100972    -1.79   0.074    -.3789507    .0172826
        st18 |  -.4255548    .109101    -3.90   0.000    -.6396214   -.2114882
        st19 |   .3685392   .0573607     6.42   0.000     .2559921    .4810863
        st20 |  -1.131981   .1508213    -7.51   0.000    -1.427907    -.836055
        st21 |   .3961276    .063419     6.25   0.000     .2716935    .5205617
        st22 |   .2869058   .1571261     1.83   0.068    -.0213907    .5952022
        st23 |   .2449163   .1050504     2.33   0.020     .0387974    .4510353
        st24 |  -.5760094   .1290485    -4.46   0.000    -.8292149   -.3228039
        st25 |   -.392985   .0779873    -5.04   0.000    -.5460035   -.2399664
        st26 |   .1455349   .0931743     1.56   0.119     -.037282    .3283517
        st27 |  -.9910133   .1227763    -8.07   0.000    -1.231912   -.7501144
        st28 |  -.4432373   .1203529    -3.68   0.000    -.6793813   -.2070933
        st29 |   .3226112    .091537     3.52   0.000     .1430069    .5022155
        st30 |  -1.277052   .1466122    -8.71   0.000    -1.564719   -.9893846
        st31 |   .1222139   .1427175     0.86   0.392    -.1578116    .4022394
        st32 |   .3817845   .0785617     4.86   0.000     .2276388    .5359302
        st33 |   .4354412   .1727981     2.52   0.012     .0963948    .7744876
        st34 |  -.0965572   .0568864    -1.70   0.090    -.2081738    .0150594
        st35 |  -1.843342   .1136284   -16.22   0.000    -2.066292   -1.620393
        st36 |  -.1884885   .1338693    -1.41   0.159    -.4511528    .0741758
        st37 |  -.0411461   .0681355    -0.60   0.546    -.1748345    .0925422
        st38 |   .0049471   .1193755     0.04   0.967    -.2292791    .2391733
        st39 |  -.3249639   .1439168    -2.26   0.024    -.6073424   -.0425853
        st40 |  -.1003761   .1670446    -0.60   0.548    -.4281337    .2273814
        st41 |    .334051   .0576435     5.80   0.000     .2209491     .447153
        st42 |  -1.024605   .1040919    -9.84   0.000    -1.228843   -.8203664
        st43 |   .0446805   .0802028     0.56   0.578    -.1126852    .2020461
        st44 |   .0526546   .1592362     0.33   0.741    -.2597821    .3650912
        st45 |  -.3039108   .1119628    -2.71   0.007    -.5235925    -.084229
        st46 |  -1.254522   .1497569    -8.38   0.000    -1.548359   -.9606845
        st47 |  -.6017665    .060131   -10.01   0.000    -.7197493   -.4837837
        st48 |  -.1321725   .1076604    -1.23   0.220    -.3434124    .0790675
        st49 |  -.9691482    .127291    -7.61   0.000    -1.218905    -.719391
        st50 |  -.7812224   .1200961    -6.50   0.000    -1.016862   -.5455823
        st51 |  -.4804004   .1293103    -3.72   0.000    -.7341196   -.2266813
       _cons |   4.036775   .3845839    10.50   0.000     3.282185    4.791366
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,1114)         =      38.77
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
       _cons |   3.866017   .3847716    10.05   0.000     3.111058    4.620975
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(50, 1114) = 142.57                  Prob > F = 0.0000

. xtreg lvio shall $basevars, fe robust;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe vce(cluster stateid);

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. bootstrap, seed(1) rep(500): xtreg lvio shall $basevars, fe;
(running xtreg on estimation sample)

Bootstrap replications (500)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                Wald chi2(8)      =     247.75
corr(u_i, Xb)  = -0.3687                        Prob > chi2       =     0.0000

                                 (Replications based on clustering on stateid)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
        lvio |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0209064    -2.21   0.027    -.0871174   -.0051657
 incarc_rate |   -.000071    .000099    -0.72   0.473    -.0002651    .0001231
     density |  -.1722901   .1205527    -1.43   0.153    -.4085691    .0639889
      avginc |  -.0092037    .006907    -1.33   0.183    -.0227412    .0043337
         pop |   .0115247   .0102342     1.13   0.260    -.0085339    .0315833
      pb1064 |   .1042804   .0163912     6.36   0.000     .0721542    .1364067
      pw1064 |   .0408611   .0050294     8.12   0.000     .0310036    .0507186
      pm1029 |  -.0502725   .0078158    -6.43   0.000    -.0655913   -.0349538
       _cons |   3.866017   .3779316    10.23   0.000     3.125284    4.606749
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. do "/Users/ericqian/Princeton/Courses/ECO 518/homework/guns_518.do"

. # delimit ;
delimiter now ;
. set more off;

. clear;

. cls;

. cd "/Users/ericqian/Princeton/Courses/ECO 518/homework";
/Users/ericqian/Princeton/Courses/ECO 518/homework

. *************************************************************;
. * 518 Exercise 4
> *
> *************************************************************;
. *log using guns_518.log,replace;
. set more 1;

. set memory 50000;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set linesize 255;

. ***********************************;
. * Read In Data;
.  use guns.dta;

. *;
. **************************************************************;
. desc;

Contains data from guns.dta
  obs:         1,173                          
 vars:            13                          21 Nov 2005 17:56
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
year            byte    %9.0g                 
vio             float   %9.0g                 Violent Crime Rate per 100,000 population (BJS)
mur             float   %9.0g                 Murder Crime Rate per 100,000 population (BJS)
rob             float   %9.0g                 Robbery Crime Rate per 100,000 population (BJS)
incarc_rate     int     %8.0g                 72-99 ONLY - Lagged Rate per 100,000 resident pop of sentenced prisoners in Stat
pb1064          float   %9.0g                 
pw1064          float   %9.0g                 
pm1029          float   %9.0g                 
pop             float   %9.0g                 
avginc          float   %9.0g                 
density         float   %9.0g                 
stateid         byte    %9.0g                 
shall           byte    %9.0g                 
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. summarize;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |      1,173          88    6.636079         77         99
         vio |      1,173    503.0747    334.2772         47     2921.8
         mur |      1,173    7.665132     7.52271         .2       80.6
         rob |      1,173    161.8202      170.51        6.4     1635.1
 incarc_rate |      1,173    226.5797    178.8881         19       1913
-------------+---------------------------------------------------------
      pb1064 |      1,173    5.336217    4.885688   .2482066   26.97957
      pw1064 |      1,173    62.94543    9.761527   21.78043   76.52575
      pm1029 |      1,173    16.08113    1.732143   12.21368   22.35269
         pop |      1,173    4.816341    5.252115    .402753   33.14512
      avginc |      1,173     13.7248    2.554543   8.554884   23.64671
-------------+---------------------------------------------------------
     density |      1,173    .3520382    1.355472   .0007071   11.10212
     stateid |      1,173    28.96078    15.68352          1         56
       shall |      1,173    .2429668    .4290581          0          1

. *************************************************************;
. gen lvio = ln(vio);

. tabulate stateid, generate(st);

    stateid |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23        1.96        1.96
          2 |         23        1.96        3.92
          4 |         23        1.96        5.88
          5 |         23        1.96        7.84
          6 |         23        1.96        9.80
          8 |         23        1.96       11.76
          9 |         23        1.96       13.73
         10 |         23        1.96       15.69
         11 |         23        1.96       17.65
         12 |         23        1.96       19.61
         13 |         23        1.96       21.57
         15 |         23        1.96       23.53
         16 |         23        1.96       25.49
         17 |         23        1.96       27.45
         18 |         23        1.96       29.41
         19 |         23        1.96       31.37
         20 |         23        1.96       33.33
         21 |         23        1.96       35.29
         22 |         23        1.96       37.25
         23 |         23        1.96       39.22
         24 |         23        1.96       41.18
         25 |         23        1.96       43.14
         26 |         23        1.96       45.10
         27 |         23        1.96       47.06
         28 |         23        1.96       49.02
         29 |         23        1.96       50.98
         30 |         23        1.96       52.94
         31 |         23        1.96       54.90
         32 |         23        1.96       56.86
         33 |         23        1.96       58.82
         34 |         23        1.96       60.78
         35 |         23        1.96       62.75
         36 |         23        1.96       64.71
         37 |         23        1.96       66.67
         38 |         23        1.96       68.63
         39 |         23        1.96       70.59
         40 |         23        1.96       72.55
         41 |         23        1.96       74.51
         42 |         23        1.96       76.47
         44 |         23        1.96       78.43
         45 |         23        1.96       80.39
         46 |         23        1.96       82.35
         47 |         23        1.96       84.31
         48 |         23        1.96       86.27
         49 |         23        1.96       88.24
         50 |         23        1.96       90.20
         51 |         23        1.96       92.16
         53 |         23        1.96       94.12
         54 |         23        1.96       96.08
         55 |         23        1.96       98.04
         56 |         23        1.96      100.00
------------+-----------------------------------
      Total |      1,173      100.00

. global st_vars "st2  st3  st4  st5  st6  st7  st8  st9 
>                 st10 st11 st12 st13 st14 st15 st16 st17 st18 st19 
>                 st20 st21 st22 st23 st24 st25 st26 st27 st28 st29 
>                 st30 st31 st32 st33 st34 st35 st36 st37 st38 st39 
>                 st40 st41 st42 st43 st44 st45 st46 st47 st48 st49
>                 st50 st51";

. global basevars "incarc_rate density avginc pop pb1064 
>                  pw1064 pm1029";

.  *************************************************************;
. xtset stateid year;
       panel variable:  stateid (strongly balanced)
        time variable:  year, 77 to 99
                delta:  1 unit

. reg lvio shall $basevars $st_vars;

      Source |       SS           df       MS      Number of obs   =     1,173
-------------+----------------------------------   F(58, 1114)     =    306.93
       Model |  459.854887        58  7.92853254   Prob > F        =    0.0000
    Residual |  28.7766714     1,114  .025831841   R-squared       =    0.9411
-------------+----------------------------------   Adj R-squared   =    0.9380
       Total |  488.631558     1,172  .416921125   Root MSE        =    .16072

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
         st2 |   .0559649   .0727213     0.77   0.442    -.0867213     .198651
         st3 |   .2404116   .0887689     2.71   0.007     .0662385    .4145848
         st4 |  -.1272757   .0664795    -1.91   0.056    -.2577149    .0031635
         st5 |   .2442405   .2304245     1.06   0.289    -.2078744    .6963554
         st6 |  -.1050866   .1121747    -0.94   0.349    -.3251842    .1150109
         st7 |  -.0955651   .1348337    -0.71   0.479    -.3601218    .1689916
         st8 |   .0975979   .0767356     1.27   0.204    -.0529647    .2481605
         st9 |   2.759405   .7797288     3.54   0.000     1.229502    4.289307
        st10 |   .6771463   .1135223     5.96   0.000     .4544047    .8998878
        st11 |   .0225319   .0538476     0.42   0.676    -.0831224    .1281861
        st12 |  -1.127962   .2590434    -4.35   0.000     -1.63623   -.6196937
        st13 |  -.5029989   .1220814    -4.12   0.000    -.7425344   -.2634634
        st14 |   .4085668   .1072083     3.81   0.000     .1982138    .6189197
        st15 |  -.2056563   .1110607    -1.85   0.064    -.4235679    .0122553
        st16 |    -.62914   .1277561    -4.92   0.000    -.8798097   -.3784703
        st17 |   -.180834   .1015614    -1.78   0.075    -.3801071    .0184391
        st18 |  -.4255548   .1049019    -4.06   0.000    -.6313824   -.2197272
        st19 |   .3685392    .057251     6.44   0.000     .2562073    .4808711
        st20 |  -1.131981   .1330361    -8.51   0.000     -1.39301   -.8709513
        st21 |   .3961276   .0592262     6.69   0.000     .2799202     .512335
        st22 |   .2869058   .1489839     1.93   0.054     -.005415    .5792265
        st23 |   .2449163   .0991731     2.47   0.014     .0503291    .4395035
        st24 |  -.5760094   .1251856    -4.60   0.000    -.8216356   -.3303833
        st25 |   -.392985   .0771168    -5.10   0.000    -.5442955   -.2416745
        st26 |   .1455349   .0922059     1.58   0.115    -.0353819    .3264516
        st27 |  -.9910133   .1051692    -9.42   0.000    -1.197365   -.7846612
        st28 |  -.4432373     .11437    -3.88   0.000    -.6676422   -.2188325
        st29 |   .3226112   .0865611     3.73   0.000       .15277    .4924524
        st30 |  -1.277052    .139976    -9.12   0.000    -1.551698   -1.002406
        st31 |   .1222139   .1265728     0.97   0.334     -.126134    .3705618
        st32 |   .3817845   .0768095     4.97   0.000     .2310769    .5324921
        st33 |   .4354412   .1459921     2.98   0.003     .1489906    .7218917
        st34 |  -.0965572   .0549367    -1.76   0.079    -.2043483    .0112339
        st35 |  -1.843342    .111446   -16.54   0.000     -2.06201   -1.624675
        st36 |  -.1884885   .1257346    -1.50   0.134    -.4351919    .0582149
        st37 |  -.0411461   .0684913    -0.60   0.548    -.1755325    .0932403
        st38 |   .0049471   .1153633     0.04   0.966    -.2214067    .2313009
        st39 |  -.3249639   .1370178    -2.37   0.018     -.593806   -.0561218
        st40 |  -.1003761   .1577365    -0.64   0.525    -.4098703     .209118
        st41 |    .334051   .0576949     5.79   0.000     .2208482    .4472539
        st42 |  -1.024605   .0989142   -10.36   0.000    -1.218684   -.8305256
        st43 |   .0446805   .0720137     0.62   0.535    -.0966174    .1859784
        st44 |   .0526546   .1451395     0.36   0.717    -.2321229    .3374321
        st45 |  -.3039108   .1136771    -2.67   0.008     -.526956   -.0808655
        st46 |  -1.254522   .1352965    -9.27   0.000    -1.519987   -.9890573
        st47 |  -.6017665   .0614983    -9.79   0.000    -.7224321   -.4811009
        st48 |  -.1321725   .1036698    -1.27   0.203    -.3355826    .0712377
        st49 |  -.9691482    .122316    -7.92   0.000    -1.209144   -.7291524
        st50 |  -.7812224   .1174512    -6.65   0.000    -1.011673   -.5507718
        st51 |  -.4804004    .121985    -3.94   0.000    -.7197467   -.2410541
       _cons |   4.036775   .3893662    10.37   0.000     3.272801    4.800749
------------------------------------------------------------------------------

. reg lvio shall $basevars $st_vars, robust;

Linear regression                               Number of obs     =      1,173
                                                F(58, 1114)       =     364.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9411
                                                Root MSE          =     .16072

------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0199433    -2.31   0.021    -.0852721    -.007011
 incarc_rate |   -.000071   .0000973    -0.73   0.466    -.0002619    .0001199
     density |  -.1722901   .1048789    -1.64   0.101    -.3780725    .0334923
      avginc |  -.0092037   .0067335    -1.37   0.172    -.0224155     .004008
         pop |   .0115247   .0097044     1.19   0.235    -.0075162    .0305655
      pb1064 |   .1042804   .0165552     6.30   0.000     .0717976    .1367633
      pw1064 |   .0408611   .0053859     7.59   0.000     .0302935    .0514287
      pm1029 |  -.0502725   .0077908    -6.45   0.000    -.0655588   -.0349863
         st2 |   .0559649   .0788371     0.71   0.478     -.098721    .2106508
         st3 |   .2404116   .0872338     2.76   0.006     .0692506    .4115727
         st4 |  -.1272757   .0714501    -1.78   0.075    -.2674676    .0129162
         st5 |   .2442405   .2377303     1.03   0.304    -.2222091    .7106901
         st6 |  -.1050866   .1180061    -0.89   0.373    -.3366259    .1264526
         st7 |  -.0955651   .1412479    -0.68   0.499     -.372707    .1815768
         st8 |   .0975979   .0824469     1.18   0.237    -.0641708    .2593666
         st9 |   2.759405   1.004794     2.75   0.006     .7879034    4.730906
        st10 |   .6771463    .120142     5.64   0.000     .4414162    .9128763
        st11 |   .0225319   .0546559     0.41   0.680    -.0847082    .1297719
        st12 |  -1.127962   .2586365    -4.36   0.000    -1.635431   -.6204921
        st13 |  -.5029989   .1235745    -4.07   0.000    -.7454639   -.2605339
        st14 |   .4085668     .11285     3.62   0.000     .1871443    .6299893
        st15 |  -.2056563   .1159915    -1.77   0.076    -.4332428    .0219302
        st16 |    -.62914   .1317084    -4.78   0.000    -.8875644   -.3707155
        st17 |   -.180834    .100972    -1.79   0.074    -.3789507    .0172826
        st18 |  -.4255548    .109101    -3.90   0.000    -.6396214   -.2114882
        st19 |   .3685392   .0573607     6.42   0.000     .2559921    .4810863
        st20 |  -1.131981   .1508213    -7.51   0.000    -1.427907    -.836055
        st21 |   .3961276    .063419     6.25   0.000     .2716935    .5205617
        st22 |   .2869058   .1571261     1.83   0.068    -.0213907    .5952022
        st23 |   .2449163   .1050504     2.33   0.020     .0387974    .4510353
        st24 |  -.5760094   .1290485    -4.46   0.000    -.8292149   -.3228039
        st25 |   -.392985   .0779873    -5.04   0.000    -.5460035   -.2399664
        st26 |   .1455349   .0931743     1.56   0.119     -.037282    .3283517
        st27 |  -.9910133   .1227763    -8.07   0.000    -1.231912   -.7501144
        st28 |  -.4432373   .1203529    -3.68   0.000    -.6793813   -.2070933
        st29 |   .3226112    .091537     3.52   0.000     .1430069    .5022155
        st30 |  -1.277052   .1466122    -8.71   0.000    -1.564719   -.9893846
        st31 |   .1222139   .1427175     0.86   0.392    -.1578116    .4022394
        st32 |   .3817845   .0785617     4.86   0.000     .2276388    .5359302
        st33 |   .4354412   .1727981     2.52   0.012     .0963948    .7744876
        st34 |  -.0965572   .0568864    -1.70   0.090    -.2081738    .0150594
        st35 |  -1.843342   .1136284   -16.22   0.000    -2.066292   -1.620393
        st36 |  -.1884885   .1338693    -1.41   0.159    -.4511528    .0741758
        st37 |  -.0411461   .0681355    -0.60   0.546    -.1748345    .0925422
        st38 |   .0049471   .1193755     0.04   0.967    -.2292791    .2391733
        st39 |  -.3249639   .1439168    -2.26   0.024    -.6073424   -.0425853
        st40 |  -.1003761   .1670446    -0.60   0.548    -.4281337    .2273814
        st41 |    .334051   .0576435     5.80   0.000     .2209491     .447153
        st42 |  -1.024605   .1040919    -9.84   0.000    -1.228843   -.8203664
        st43 |   .0446805   .0802028     0.56   0.578    -.1126852    .2020461
        st44 |   .0526546   .1592362     0.33   0.741    -.2597821    .3650912
        st45 |  -.3039108   .1119628    -2.71   0.007    -.5235925    -.084229
        st46 |  -1.254522   .1497569    -8.38   0.000    -1.548359   -.9606845
        st47 |  -.6017665    .060131   -10.01   0.000    -.7197493   -.4837837
        st48 |  -.1321725   .1076604    -1.23   0.220    -.3434124    .0790675
        st49 |  -.9691482    .127291    -7.61   0.000    -1.218905    -.719391
        st50 |  -.7812224   .1200961    -6.50   0.000    -1.016862   -.5455823
        st51 |  -.4804004   .1293103    -3.72   0.000    -.7341196   -.2266813
       _cons |   4.036775   .3845839    10.50   0.000     3.282185    4.791366
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,1114)         =      38.77
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

------------------------------------------------------------------------------
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0188668    -2.45   0.015      -.08316    -.009123
 incarc_rate |   -.000071   .0000936    -0.76   0.448    -.0002547    .0001126
     density |  -.1722901   .0850362    -2.03   0.043    -.3391392   -.0054409
      avginc |  -.0092037   .0059083    -1.56   0.120    -.0207963    .0023889
         pop |   .0115247   .0087239     1.32   0.187    -.0055924    .0286417
      pb1064 |   .1042804   .0177564     5.87   0.000     .0694407    .1391201
      pw1064 |   .0408611   .0050745     8.05   0.000     .0309044    .0508177
      pm1029 |  -.0502725   .0064037    -7.85   0.000    -.0628373   -.0377078
       _cons |   3.866017   .3847716    10.05   0.000     3.111058    4.620975
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(50, 1114) = 142.57                  Prob > F = 0.0000

. xtreg lvio shall $basevars, fe robust;

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg lvio shall $basevars, fe vce(cluster stateid);

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                F(8,50)           =      34.10
corr(u_i, Xb)  = -0.3687                        Prob > F          =     0.0000

                               (Std. Err. adjusted for 51 clusters in stateid)
------------------------------------------------------------------------------
             |               Robust
        lvio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0417616    -1.10   0.275    -.1300223    .0377392
 incarc_rate |   -.000071   .0002504    -0.28   0.778    -.0005739    .0004318
     density |  -.1722901   .1376129    -1.25   0.216    -.4486936    .1041135
      avginc |  -.0092037   .0129649    -0.71   0.481    -.0352445     .016837
         pop |   .0115247    .014224     0.81   0.422    -.0170452    .0400945
      pb1064 |   .1042804   .0326849     3.19   0.002     .0386308    .1699301
      pw1064 |   .0408611   .0134585     3.04   0.004     .0138289    .0678932
      pm1029 |  -.0502725   .0206949    -2.43   0.019    -.0918394   -.0087057
       _cons |   3.866017   .7701057     5.02   0.000     2.319214    5.412819
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. bootstrap, seed(1) rep(500): xtreg lvio shall $basevars, fe;
(running xtreg on estimation sample)

Bootstrap replications (500)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                Wald chi2(8)      =     247.75
corr(u_i, Xb)  = -0.3687                        Prob > chi2       =     0.0000

                                 (Replications based on clustering on stateid)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
        lvio |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0209064    -2.21   0.027    -.0871174   -.0051657
 incarc_rate |   -.000071    .000099    -0.72   0.473    -.0002651    .0001231
     density |  -.1722901   .1205527    -1.43   0.153    -.4085691    .0639889
      avginc |  -.0092037    .006907    -1.33   0.183    -.0227412    .0043337
         pop |   .0115247   .0102342     1.13   0.260    -.0085339    .0315833
      pb1064 |   .1042804   .0163912     6.36   0.000     .0721542    .1364067
      pw1064 |   .0408611   .0050294     8.12   0.000     .0310036    .0507186
      pm1029 |  -.0502725   .0078158    -6.43   0.000    -.0655913   -.0349538
       _cons |   3.866017   .3779316    10.23   0.000     3.125284    4.606749
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. bootstrap, seed(1) rep(500): xtreg lvio shall $basevars, fe robust;
(running xtreg on estimation sample)

Bootstrap replications (500)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500

Fixed-effects (within) regression               Number of obs     =      1,173
Group variable: stateid                         Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.2178                                         min =         23
     between = 0.0033                                         avg =       23.0
     overall = 0.0001                                         max =         23

                                                Wald chi2(8)      =     247.75
corr(u_i, Xb)  = -0.3687                        Prob > chi2       =     0.0000

                                (Replications based on 51 clusters in stateid)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
        lvio |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       shall |  -.0461415   .0209064    -2.21   0.027    -.0871174   -.0051657
 incarc_rate |   -.000071    .000099    -0.72   0.473    -.0002651    .0001231
     density |  -.1722901   .1205527    -1.43   0.153    -.4085691    .0639889
      avginc |  -.0092037    .006907    -1.33   0.183    -.0227412    .0043337
         pop |   .0115247   .0102342     1.13   0.260    -.0085339    .0315833
      pb1064 |   .1042804   .0163912     6.36   0.000     .0721542    .1364067
      pw1064 |   .0408611   .0050294     8.12   0.000     .0310036    .0507186
      pm1029 |  -.0502725   .0078158    -6.43   0.000    -.0655913   -.0349538
       _cons |   3.866017   .3779316    10.23   0.000     3.125284    4.606749
-------------+----------------------------------------------------------------
     sigma_u |  .68024951
     sigma_e |  .16072287
         rho |  .94712779   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. bootstrap, seed(1) rep(500): xtreg lvio shall $basevars, fe vce(cluster stateid);
(running xtreg on estimation sample)

Bootstrap replications (500)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
repeated time values within panel
the most likely cause for this error is misspecifying the cluster(), idcluster(), or group() option
r(451);

end of do-file

r(451);

